[
  {
    "id":1,
    "title": "Learn HTML and CSS",
    "source": "Scrimba.com",
    "description": "This course teachs HTML and CSS through building and deploying five small projects. It has over 75 coding challenges. There are no prerequisites, so it is suitable for beginners.",
    "duration": "6 hours",
    "level": "Beginner",
    "certificateLink": "HTMLandCSS.pdf"
  },
  {
    "id":2,
    "title": "Learn Flexbox",
    "source": "Scrimba.com",
    "description": "This course teaches CSS Flexbox through 12 interactive screencasts. Learn all the key concepts in addition to building a responsive navbar and a neat image grid.",
    "duration": "1 hour",
    "level": "Intermediate",
    "certificateLink": "Flexbox.pdf"
  },
  {
    "id":3,
    "title": "Learn CSS Grid",
    "source": "Scrimba.com",
    "description": "This tutorial teaches CSS Grid through 14 interactive screencasts. Learn all the key concepts while building three layouts: a website, an image grid, and an article. Learn how to combine CSS Grid with Flexbox",
    "duration": "1 hour",
    "level": "Intermediate",
    "certificateLink": "CSSGrid.pdf"
  },
  {
    "id":4,
    "title": "Introduction to Supabase",
    "source": "Scrimba.com",
    "description": "Master Supabase essentials by building a real-world sales dashboard that fetches, inserts, and updates data in real-time.",
    "duration": "1 hour",
    "level": "Intermediate",
    "certificateLink": "IntrotoSupabase.pdf"
  },
  {
    "id":5,
    "title": "Introduction to Design Fundamentals",
    "source": "Scrimba.com",
    "description": "This coures teaches you to design user interfaces that both look good and work well. All is done with HTML and CSS, so no design tools needed.",
    "duration": "1 hour",
    "level": "Intermediate",
    "certificateLink": "IntrotoUIDesignFundamentals.pdf"
  },
  {
    "id":6,
    "title": "Intro to Vite",
    "source": "Scrimba.com",
    "description": "Become a lightning-fast developer with Vite — the speed-focussed build tool that makes working with modern frameworks smooth, efficient, and enjoyable.",
    "duration": "30 minutes",
    "level": "Intermediate",
    "certificateLink": "IntrotoVite.pdf"
  },
  {
    "id":7,
    "title": "Build a Multi-page website with HTML and CSS",
    "source": "Scrimba.com",
    "description": "Bring a Frontend Mentor design to life and create your own design system while building a multi-page space travel website with Kevin Powell as your guide.",
    "duration": "7 hours",
    "level": "Intermediate",
    "certificateLink": "Multi-PageWebsiteHTMLandCSS.pdf"
  },
  {
    "id":8,
    "title": "Build a Memory Game in React",
    "source": "Scrimba.com",
    "description": "Create an accessible, interactive memory game using React. This course takes you through building a polished project while exploring how to fetch data, manage state, and implement best practices for inclusivity and functionality.",
    "duration": "4 hours",
    "level": "Intermediate",
    "certificateLink": "MemoryGameinReact.pdf"
  },
  {
    "id":9,
    "title": "Learn Next.js",
    "source": "Scrimba.com",
    "description": "Learn to build web apps with Next.js, the world's most popular full-stack framework. You'll cover routing, layouts, data fetching, optimizing assets, and more, while building PrintForge, a site for 3D printing enthusiasts.",
    "duration": "2 hours",
    "level": "Intermediate",
    "certificateLink": "Nextjs.pdf"
  },
  {
    "id":10,
    "title": "Learn Tailwind CSS",
    "source": "Scrimba.com",
    "description": "The ultimate hands-on journey with Tailwind CSS! Learn the essentials of Tailwind and then flex your new skills with five real-world projects.",
    "duration": "2 hours",
    "level": "Intermediate",
    "certificateLink": "TailwindCSS.pdf"
  },
  {
    "id":11,
    "title": "Learn Node.js",
    "source": "Scrimba.com",
    "description": "Discover how to craft fast, efficient backends with Node.js, the go-to runtime for modern web developers. From APIs to fullstack apps, see how Node.js makes backend development smooth, scalable, and fun.",
    "duration": "1 hour",
    "level": "Intermediate",
    "certificateLink": "Node.js.pdf"
  },
  {
    "id":12,
    "title": "The Frontend Developer Career Path",
    "source": "Scrimba.com",
    "description": "Launch your career as a frontend developer with this immersive path. Created in collaboration with Mozilla MDN, ensuring that you'll learn the latest best practices for modern web development, and stand out from other job applicants.",
    "duration": "81 hours",
    "level": "Beginner",
    "certificateLink": "FrontendDeveloperCareerPath.pdf"
  },
  {
    "id":13,
    "title": "Learn React",
    "source": "Scrimba.com",
    "description": "The ultimate React 101 course! Designed with MDN Web Docs, it’s the perfect place to learn modern React basics interactively. Tackle 170+ coding challenges and build six projects, gaining confidence to create real-world applications.",
    "duration": "15 hours",
    "level": "Beginner",
    "certificateLink": "LearnReact.pdf"
  },
  {
    "id":14,
    "title": "Advanced React",
    "source": "Scrimba.com",
    "description": "The best learning experience paired with a world-class instructor. This massive course aims to turn you into hireable React developer as fast as possible.",
    "duration": "13 hours",
    "level": "Advanced",
    "certificateLink": "AdvancedReact.pdf"
  },
  {
    "id":15,
    "title": "Learn Typescript",
    "source": "Scrimba.com",
    "description": "This course introduces you to the essential building blocks of TypeScript through a hands-on approach—developing a simple pizza restaurant order fulfillment system. In this course, you’ll explore: basic types, defining custom types, typing objects and arrays, optional properties, manual and implicit typing, literal types, unions and intersections, type narrowing, function return types, void and any, utility types (Partial and Omit), and generics.",
    "duration": "2 hours",
    "level": "Intermediate",
    "certificateLink": "LearnTypescript.pdf"
  },
  {
    "id":16,
    "title": "React Router 6",
    "source": "Scrimba.com",
    "description": "Learn React Router v6, the most popular routing library for React applications and one of the most downloaded React support libraries ever.",
    "duration": "10 hours",
    "level": "Intermediate",
    "certificateLink": "ReactRouter6.pdf"
  },
  {
    "id":17,
    "title": "Agile Team Coaching - ICP",
    "source": "The Agile Company",
    "description": "You will learn how to determine team maturity and create an environment conducive to the development of your teams towards high performance. You will actively practice and experiment with the concepts of team development and dynamics, change management, alliance building and coaching contracts",
    "duration": "21 hours",
    "level": "Intermediate",
    "certificateLink": "https://www.icagile.com/credentials/b843c268-8606-4646-81c6-990831c274b1"
  },
  {
    "id":18,
    "title": "Agile Team Facilitation - ICP",
    "source": "The Agile Company",
    "description": "This program equips participants with the skills to become effective Professional Agile Team Facilitators. You will gain a comprehensive understanding of Agile principles, methods, and facilitation tools. Key learning includes mastering the preparation and facilitation of various Agile meetings, including strategies for handling conflict or complicated situations using a solutions-focused approach. The course also covers how to accommodate Agile transformations and adapt them to specific contexts.",
    "duration": "14 hours",
    "level": "Intermediate",
    "certificateLink": "https://www.icagile.com/credentials/b843c268-8606-4646-81c6-990831c274b1"
  },
  {
    "id":19,
    "title": "Professional Scrum Master - 'Level 1'",
    "source": "Scrum.org",
    "description": "Students leave this course with an appreciation for Professional Scrum, the agile mindset and how to deal with common myths and impediments to agility. They gain the knowledge and understanding about how to choose and apply the appropriate practices and techniques that will be most beneficial for their Scrum Teams."
  },
  {
    "id":20,
    "title": "Tread Lightly Trainer",
    "source": "Tread Lightly",
    "description": "The Tread Trainer program is designed to train participants in innovative, practical methods of spreading outdoor ethics to the public with a curriculum specifically focused on motorized and mechanized recreation. Once a participant becomes active in the Tread Trainer program he or she is equipped with the knowledge to recreate responsibly; present the Tread Lightly! message to other educators, clubs, employees, visitors, enthusiasts or community members, or train additional Tread Lightly! instructors."
  },
  {
    "id":21,
    "title": "Adult First Aid/CPR/AED",
    "source": "American Red Cross",
    "description": "The Adult First Aid/CPR/AED course equips students with the knowledge necessary to recognize and care for a variety of first aid, breathing, and cardiac emergencies involving adults."
  },
  {
    "id":22,
    "title": "Wilderness and Remote First Aid",
    "source": "American Red Cross",
    "description": "Designed for scouts and scout leaders, outdoor enthusiasts and anyone who works or spends time in remote environments, this course teaches advanced skills to be used in emergencies when help from professional first responders may be far away."
  }
]
