[
  {
    "id": 1,
    "employer": "Bronco Off-Roadeo",
    "employerLink": "www.broncooffroadeo.com",
    "position": "Instructor",
    "location": "Gilford NH",
    "description": [
      "Act as the primary guide for guests embarking on the immersive Bronco Off-Roadeo learning adventure. Your mission is to build instant trust and confidence, enabling drivers to master their vehicle's capabilities in challenging, unusual terrain."
    ],
    "bullets":[
      "Provide expert, real-time instruction and coaching to ensure guests are learning safely while maximizing their fun.",
      "Continuously verify safe driving practices and offer constructive, immediate feedback on off-road techniques.",
      "Partner with the instructor team for daily vehicle preparation and route planning.",
      "Manage the day's schedule while skillfully adapting the experience to real-time trail conditions and guest needs."
    ],
    "startDate": "2023",
    "endDate": "Present",
    "quotes":true
  },
  {
    "id": 2,
    "employer": "Meltwater",
    "position": "Agile Coach",
    "location": "Manchester NH",
    "description": ["Drove significant improvements in organizational efficiency and Agile maturity across multiple teams. "],
    "bullets": [
      "Directed cross-functional execution by leading daily ceremonies for up to five simultaneous development teams",
      "Spearheaded company-wide strategic initiatives, including coordinating the Front-End Guild—a critical forum for both regular meetings and strategic off-site planning.",
      "Accelerated product development by facilitating efficient UX Design Review meetings.",
      "Developed and deployed the 'Meltwater Maturity Matrix,' a quantifiable tool that enabled development teams to assess, understand, and optimize their specific Agile practices.",
      "Strengthened organizational coaching capacity by mentoring junior Agile coaches.",
      "Established data-driven insights for team performance by building statistical analysis applications using Jira data.",
      "Ensured successful team evolution by leading comprehensive Team Launch and Re-Launch events."

    ],
    "startDate": "2018",
    "endDate": "2023"
  },
  {
    "id": 3,
    "employer": "Autodesk",
    "position": "Agile Coach",
    "location": "Manchester NH",
    "startDate": "2014",
    "endDate": "2018",
    "description": ["Executed implementation and advancement of a unified agile framework across our division, encompassing up to 35 teams distributed across the US, Europe, and Asia. Involved in establishing standardized scrum ceremonies, optimal sprint durations, effective utilization of agile tools, clear definitions of completion, and collaborative team accords. Collaborated with individual teams to detect and rectify counterproductive practices, offering tailored recommendations for enhancements that align with consistent reinforcement of agile principles and values. "],
    "bullets": [
      "Guided facilitation of Agile Maturity Team Assessments, empowering teams to cultivate enduring positive behaviors.",
      "Crafted and provided diverse training modules, spanning Team, Product Owner, Scrum Master, and Agile Refresher courses.",
      "Orchestrated Epic Definition workshops involving teams and stakeholders, fostering comprehension of envisioned outcomes.",
      "Instituted dedicated communities of practice for Product Owners and Scrum Masters, fostering exchange of insights and methodologies to collaboratively troubleshoot challenges."
    ]
  },
  {
    "id": 4,
    "employer": "Autodesk",
    "position": "User Experience Manager / Agile Coach",
    "startDate": "2010",
    "endDate": "20214",
    "location": "Manchester NH",
    "description": ["Provided leadership to an international User Experience team and drove Agile maturity across product development groups for key Architecture, Engineering, and Construction (AEC) products."],
    "bullets": [
      "Directly managed and directed an international cohort of UX Designers responsible for the visual and interaction design of premier AEC products.",
      "Regularly examined and scrutinized research findings, workflows, and interfaces presented by the design teams to enforce uniformity and coherence across the entire product spectrum and internal offerings.",
      "Acted as an Agile Coach for numerous development teams, providing guidance on process optimization.",
      "Established a Scrum Master's Practice group to institutionalize knowledge sharing, advance discussions on Agile methodologies, and collaboratively troubleshoot team dynamics issues.",
      "Partnered closely with Product Management to define team objectives and ensure clear communication protocols for requirements, streamlining the development process.",
      "Consulted with various teams and managers to drive improvements in processes and workflows, ensuring the best possible outcomes were achieved."
    ]
  },
  {
    "id": 5,
    "employer": "Autodesk",
    "position": "User Experience Designer",
    "startDate": "2003",
    "endDate": "2010",
    "location": "Manchester NH",
    "description": ["Acted as the User Experience Designer for all Mechanical, Electrical and Piping functionality for Autodesk's Flagship AEC platform, Revit. Conducted user research, managed the beta program, conducted regular meetings with customers to gather feedback and better understand workflows."]
  }
]
