[
  {
    "id":1,
    "quote":"This was amazing! Jason our guide knew so much about the Bronco and I was in awe of what the Bronco could do off road!! "
  },
  {
    "id":2,
    "quote":"The staff was excellent, and our trail guide Jason was exceptionally knowledgeable and caring. "
  },
  {
    "id":3,
    "quote":"We loved our experience in New Hampshire! We learned a lot and our guide, Jason, was great.  "
  },
  {
    "id":4,
    "quote":"Jason was very patient and calm during the experience, which helped me feel more confident during the experience for a first time off roading. "
  },
  {
    "id":5,
    "quote":"Jason was our guide for the off-roading course and he was fantastic! I have a much more comprehensive  understanding of the intricacies of off roading. The other guide were also very knowledgeable and enthusiastic. The entire team made it a wonderful experience and I feel more confidant  off road now. Thanks for a great time!! "
  },
  {
    "id":6,
    "quote":"Fantastic experience. Jason was very knowledgable, great teacher and allowed us to learn by experiencing it for ourselves. Overall great experience! "
  },
  {
    "id":7,
    "quote":"Trail guides Evan and Jason were extremely knowledgeable, personable, and entertaining!  I would highly recommend off rodeo to anyone interested in off roading.   "
  },
  {
    "id":8,
    "quote":"Our guide Jason was amazing! I think he made the experience top notch! "
  },
  {
    "id":9,
    "quote":"Loved our time there and our guide Jason was fun and very informative."
  },
  {
    "id":10,
    "quote":"Our guide Jason was outstanding! Very patient and knowlegeable. "
  },
  {
    "id":11,
    "quote":"Even though I was terrified, this was so awesome.  I loved my guides - Jason, Jordan and Evan. They were all very knowledgeable. I now know how to do some great 4x4 tricks if I ever need to.   Thank you to Jason for letting me ride in the lead Bronco with him.  It sure eased my mind. And my family is amazed at the picture I sent of myself, heading down over some rocks, tipped up on 3 wheels. I told them I guess you really only need 3.  "
  }, 
  {
    "id":12,
    "quote":"Evan and Jason were nothing short of awesome.  Learned so much about my new car, thanks!!! "
  }
]